RubyOnRails-HartlAssignment-MessengerApp/app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", ""]]
---
  def create
    # vind de user
    user = User.find_by(email: params[:session][:email].downcase)