RubyOnRails-HartlAssignment-MessengerApp/app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    #params[:id] gets the id of the user from the User controller.
    # for example: "1". Tht find method returns the corresponding user
  @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 44017129]]
---
  def edit
    # the parameters are submitted in the corresponding view
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 44017129]]
UPDATE "users" SET "password_digest" = ?, "admin" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$04$egIhvgY2o3aWxJ.pviYZ4etERgCbrlKQt8qZbUUhb880cuq9wZJDS"], ["admin", "t"], ["updated_at", "2016-05-03 14:03:40.189254"], ["id", 753762654]]
---
def update
  @user = User.find(params[:id])
  if @user.update_attributes(user_params)